0	/*
0	 * 객체지향 프로그래밍(Object Oriented Programming)
0	 * 	 우리 일상에서이루어지고있는 업무를 객체(Object)를 사용해서
0	 *   프로그래밍하는방법
0	 *   
0	 *    1. 실제 주차장관리 업무파악
0	 *      (객체를 도출하고 그객체들의 관계에의한 업무파악) 
0	 *    2. 프로그램으로 작성 
0	 *      (1번에서 파악된업무를 메모리상에서 그대로구현) 
0	 *   
0	 *    ex> 주차관리 프로그램 
0	 *     
0	 * 
0	 * 	 - 객체(업무):실제이루어지고있는 업무(주차장)에서 보여지고
0	 *               구체화되어있는 사물(차)    
0	 *   
0	 *   - 객체(프로그램):실제이루어지고있는 업무(주차장)에서 보여지고
0	 *                  구체화되어있는 사물을 메모리의 데이타로
0	 *                  표현한것(차의데이타)
0	 *                   
0	 * 
0	 * 
0	 * 
0	 * 
0	 */
0
0
0}
